[
    {
        "Course Title Long \n(Short)": "Programs, Information and People \n(Prog, Info & People)",
        "Current Enforced Prerequisites": null,
        "Course Description": " Introduction to Python programming with a focus on applications in informatics.  Covers the fundamental elements of a modern programming language and how to access data on the internet.  Explores how humans and technology complement one another, including techniques used to coordinate groups of people working together on software development.",
        "Credits": 4,
        "code": "SI106"
    },
    {
        "Course Title Long \n(Short)": "Dungeon Mastery: Running Tabletop Tales and Imaginary Worlds \n(Dungeon Mastery)",
        "Current Enforced Prerequisites": null,
        "Course Description": "Learn to prepare, organize, and run successful tabletop role-playing games from any game system, both in person and via teleconference. Suitable for both novices and experienced players, this course covers creative techniques and skills relevant to running to role-playing games. It includes performance, the application of game rules during play, and the creation of new materials such as dungeons, monsters, and loot.",
        "Credits": 1,
        "code": "SI107"
    },
    {
        "Course Title Long \n(Short)": "Programs, Information and People \n(Prog, Info & People)",
        "Current Enforced Prerequisites": null,
        "Course Description": "Learn to prepare, organize, and run successful tabletop role-playing games from any game system, both in person and via teleconference. Suitable for both novices and experienced players, this course covers creative techniques and skills relevant to running to role-playing games. It includes performance, the application of game rules during play, and the creation of new materials such as dungeons, monsters, and loot.",
        "Credits": 4,
        "code": "SI110"
    },
    {
        "Course Title Long \n(Short)": "Data-Oriented Programming \n(Data-Oriented Prog)",
        "Current Enforced Prerequisites": "(SI 106 or waiver) or EECS 182 or EECS 183 or ENGR 101; (C- or better)",
        "Course Description": "Students develop their core programming and software development skills, to build competency and literacy in important areas that includes basic data structures, debugging and testing, using distributed code repositories, pattern matching, and programmatic gathering and processing of data. Applications in assignments and labs are oriented around data manipulation.",
        "Credits": 4,
        "code": "SI206"
    },
    {
        "Course Title Long \n(Short)": "Opportunity in the Age of Intelligent Machines \n(Intelligent Machines)",
        "Current Enforced Prerequisites": null,
        "Course Description": "\"What to Do When Machines Do Everything\"-Automation isn't a new story. Across the centuries, the burden of work has shifted from humans to machines. But something is different today. Our machines are acquiring intelligence, and they're becoming mobile. At some point, no job will be spared the risk of automation. We will investigate this looming reality together, explore the ramifications, and attempt to answer the driving question.",
        "Credits": 3,
        "code": "SI260"
    },
    {
        "Course Title Long \n(Short)": "Career and Internship Studio: Design Your Success \n(Career/Intern Studio)",
        "Current Enforced Prerequisites": null,
        "Course Description": "In this course, students will engage in a synthesis of knowledge and skill formation as well as practice in internship/career readiness and professional development.\nThis course will integrate practice, as well as peer coaching and facilitation in small group activities and reflection. Students will also be exposed to various industry and alumni speakers.\nAt the end of this course students will be able to articulate and implement professional development and career readiness skills that provide for the foundation of success in the internship search, the internship experience, as well as future professional environments.",
        "Credits": 1,
        "code": "SI300"
    },
    {
        "Course Title Long \n(Short)": "Models of Social Information Processing \n(Models of Social Inf)",
        "Current Enforced Prerequisites": "(Prerequisite: EECS 280) or (Co-requisite: SI 206); (C- or better)",
        "Course Description": "This course focuses on how social groups form, interact, and change.  We look at the technical structures of social networks and explore how individual actions are combined to produce collective effects.  The techniques learned in this course can be applied to understanding friend systems like Facebook, recommender systems such as Digg, auction systems such as Ebay, and information webs used by search engines such as Google.  This course introduces two conceptual models, networks and games, for how information flows and is used in multi-person settings.  Networks or graph representations describe the structure of connections among people and documents.  They permit mathematical analysis and meaningful visualizations that highlight different roles played by different people or documents, as well as features of the collection as a whole.  Game representations describe, in situations of interdependence, the actions available to different people and how each person's outcomes are contingent on the choices of other people.  It permits analysis of stable sets of choices by all the people (equilibrium's).  It also provides a framework for analysis of the likely effects of alternative designs for markets and information elicitation mechanisms, based on their abstract game representations.  Assignments in the course include problem sets exploring the mechanics of the models and essays applying them to current applications in social computing.",
        "Credits": 4,
        "code": "SI301"
    },
    {
        "Course Title Long \n(Short)": "Information Environments and Work \n(Info Environs & Work)",
        "Current Enforced Prerequisites": "SI 110 or waiver; (C- or better)",
        "Course Description": "This course looks at information's role in organizations, including psychological, economic, management and sociocultural perspectives.  Explores sense-making and effective communication, including the importance of \"story-telling.\"  Covers key humanistic perspectives and ethical issues related to information.  Goes into the nature of requirements and helps students learn to \"swim in a sea of data\" in organizations.  The course focuses on the importance of working at the frontier.",
        "Credits": 4,
        "code": "SI310"
    },
    {
        "Course Title Long \n(Short)": "Special Topics in Information \n(Spec Topics in Info)",
        "Current Enforced Prerequisites": null,
        "Course Description": "Special Topics in Information",
        "Credits": 1641168000000,
        "code": "SI311"
    },
    {
        "Course Title Long \n(Short)": "Interpersonal and Psychological Implications of Social Media \n(Media: Others & Self)",
        "Current Enforced Prerequisites": null,
        "Course Description": "This course provides students with a strong theoretical foundation for approaching the ways in which new social media platforms can shape how interpersonal relationships are initiated, maintained, and developed as well as the implications of these tools for psychological processes.",
        "Credits": 3,
        "code": "SI315"
    },
    {
        "Course Title Long \n(Short)": "Graphic Design \n(Graphic Design)",
        "Current Enforced Prerequisites": null,
        "Course Description": "The conceptual part of the course covers the graphic design theory discourse.  Students will reinforce the practical application of critical thinking; will learn how to apply it to a broader cultural, technological, and social context.  Students will develop their aesthetic sensibilities and design skills through mastering visual language vocabulary, understanding principles of effective visual communication, solving creative problems, and developing analytical thinking, promoting thus their ability to respond professionally to rapidly changing needs of the modern world.  While studying the elements of color, layout and grids, typography, illustrations, and web/digital design, students will build their own portfolio, in the hands-on part of the course, students will explore issues at the intersection of visual information and technology.  They will work on versatile tasks related to digital graphic productions for web:  file formats and images, background textures, collages, UI elements, grid-based website mockups for CSS frameworks.  The tools and features of Adobe Creative Suite will allow students to get the necessary skills, providing them with hands-on experience, and familiarizing them with the standard professional tasks of the always-changing world of digital environment.",
        "Credits": 4,
        "code": "SI320"
    },
    {
        "Course Title Long \n(Short)": "Data Manipulation \n(Data Manipulation)",
        "Current Enforced Prerequisites": "SI 206 or SI 206 waiver; (C- or better)",
        "Course Description": "Data analysis is crucial to application evaluation, as well as understanding users' information needs.  When the data required are numerous we need an automated way to gather, parse, and summarize the data.  In this course, you will learn to use Python and its modules to accomplish these tasks.",
        "Credits": 4,
        "code": "SI330"
    },
    {
        "Course Title Long \n(Short)": "Persuasion and Social Influence \n(Persuade & Soc Influ)",
        "Current Enforced Prerequisites": null,
        "Course Description": "Social Influence is one of the most pervasive and powerful mechanisms for behavior change whether you are an informatics professional who is building up your design tool-box, designing a new information system or managing a team.  In this course we will learn why and under what conditions an individual's thoughts and actions can be influenced by those around them. The primary goal of this course is to introduce you to some of the theories and key research findings in the field of persuasion and social influence through the lens of economics and social psychology.  The second goal is to have you applying the tools of influence from day one of the course: you will learn techniques for persuasive speaking, writing and designing.  All written and oral assignments will use short and targeted exercises to gain fluency in applying the techniques and ideas of persuasion.  Finally, the course will culminate in an application of these techniques in two case studies (one covering a management problem and one a design challenge). Though we will rely on theories, and learn about the key research findings, this course is suitable for anyone with any background but tailored directly to the needs of informatics students.  The class will be heavily directed toward applying what we learn to practice and real world situations. Class meetings include a mixture of lecture and exposition through the use of experiments, an assortment of group activities and class discussion so that you can see and test some of the theories and techniques of social influence first hand.",
        "Credits": 3,
        "code": "SI334"
    },
    {
        "Course Title Long \n(Short)": "Social Media in Organizations \n(Social Media in Orgs)",
        "Current Enforced Prerequisites": null,
        "Course Description": "This course will address the technical, social, and psychological factors related to how organizations adopt and use social media technologies. Emphasis will be placed on how organizations can leverage social media to communicate with external stakeholders as well as support internal organizational processes such as collaboration, knowledge management, and innovation.",
        "Credits": 3,
        "code": "SI335"
    },
    {
        "Course Title Long \n(Short)": "Web Design, Development, and Accessibility \n(WebDesign,Dev,Access)",
        "Current Enforced Prerequisites": "EECS 183 or ENGR 101 or SI 106 or SI 106 waiver; (C- or better)",
        "Course Description": "This course provides a hands-on approach to learning responsive, accessible front-end programming for Web Design. Topics covered include HTML5, CSS3 (including Bootstrap framework), JavaScript, and the POUR design principles of accessible design. ",
        "Credits": 4,
        "code": "SI339"
    }
]